[
  {
    "jobTitle": "Farmworkers and Laborers",
    "recApplyEmail": "N/A",
    "experience_required": "No",
    "company": "Bridgeside Farms, LLC",
    "location": "Waynesboro, PA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17177654016",
    "caseNumber": "H-300-25148-025591",
    "job_duties": "Workers will perform assigned duties as instructed by their supervisor. Duties may vary from time to time. Following supervisors instruction, workers will harvest, load, and grade various types of vegetables. The worker will require use of hand tools such as shears and knives. This work can require standing, walking, stooping, bending and lifting up to 50 pounds for long periods of time outdoors in all weather conditions. It also includes making important decisions based on size, coloring and ri...",
    "job_index": 0
  },
  {
    "jobTitle": "General Farm/harvest Worker",
    "recApplyEmail": "humanresources@driscollmc.com",
    "experience_required": "No",
    "company": "Driscoll Brothers, Partnership",
    "location": "Aberdeen, ID",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "1-866-4-USA-DOL",
    "caseNumber": "H-300-25162-082052",
    "job_duties": "Worker will be required to perform a variety of duties related to the production of corn, alfalfa hay, grass hay, potatoes, sugar beets, wheat, teff and barley. The majority of the work activities during the overall contract period, however, will be related to general farm work/irrigation/crop production. General Farm Work will include the following responsibilities: maintain, drive, attach and operate farm implements/tractors/equipment to till soil, plant, cultivate, fertilize and harvest crops...",
    "job_index": 24
  },
  {
    "jobTitle": "General Farm/harvest Worker",
    "recApplyEmail": "jjpahl@gmail.com",
    "experience_required": "No",
    "company": "US-2 Farms, LLC",
    "location": "American Falls, ID",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12087052930",
    "caseNumber": "H-300-25162-081599",
    "job_duties": "Worker will be required to perform a variety of duties found in SOC Code 45-2092 Farmworkers and Laborers, Crop, Nursery, and Greenhouse, as well as SOC Code 45-2091 Agricultural Equipment Operators and are related to the production of sugar beets, wheat, barley, and potatoes. The majority of the work activities during the overall contract period, however, will be related to general farm work/irrigation/crop production. General Farm Work will include the following responsibilities: maintain, dri...",
    "job_index": 27
  },
  {
    "jobTitle": "Food Preparation Worker",
    "recApplyEmail": "brad@emmettcontracting.com",
    "experience_required": "No",
    "company": "Plymouth Orchards & Cider Mill",
    "location": "Plymouth, MI",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17344552290",
    "caseNumber": "H-400-25161-076147",
    "job_duties": "Worker will operate a robotic donut frying machine. Machine is a Belashaw Mark II Donut Maker. It is approximately 5 feet long X 2.5 feet wide. Using the machine, the worker may make between 25 – 37 dozen donuts per hour during busy times of day/ season. Worker may mix donut mix and feed into donut dispenser apparatus attached to the machine. Worker shall hand dip each cooked donut into a bowl of donut icing by hand and place on cooling racks by hand to be packaged for sale to customer. Worker m...",
    "job_index": 28
  },
  {
    "jobTitle": "Nursery Workers",
    "recApplyEmail": "delnorteharvesting@gmail.com",
    "experience_required": "No",
    "company": "Del Norte Harvesting, LLC",
    "location": "El Campo, TX",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18634415139",
    "caseNumber": "H-300-25162-079333",
    "job_duties": "Nursery Work - Including but not limited to, Tree and Shrub Maintenance, Shipping, Planting, and Facilities Maintenance. Harvesting berries and maintaining fields. Workers may be requested to submit to random drug or alcohol tests at no cost to the worker. Prolonged standing, bending, stooping, and reaching. Job continues in all types of weather. Must be able to lift 50lbs. to shoulder height repetitively throughout the workday and be able to carry 50lbs. while walking various distances. Workers...",
    "job_index": 32
  },
  {
    "jobTitle": "Farm Workers",
    "recApplyEmail": "accounting@wigginswatermelons.com",
    "experience_required": "No",
    "company": "Wiggins Watermelons, LLC (TX2)",
    "location": "Dalhart, TX",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19792721076",
    "caseNumber": "H-300-25159-065942",
    "job_duties": "Crops/Commodities: Farm work: Watermelons. Perform manual and mechanized labor to harvest, grade, sort, load, and pack watermelon. Watermelons are harvested by hand using hand tools. During the cutting process, a farm worker walks in a designated area selecting mature watermelons to be harvested by sight only. Once a watermelon has been selected for harvest, the cutter will sever the watermelon from the vine with a knife and place it in the designated area. The selection of mature watermelons to...",
    "job_index": 33
  },
  {
    "jobTitle": "Shuttle Drivers and Chauffeurs",
    "recApplyEmail": "harvestingrr@gmail.com",
    "experience_required": "No",
    "company": "R & R HARVESTING, INC",
    "location": "THREE RIVERS, MI",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18636740601",
    "caseNumber": "H-300-25152-038635",
    "job_duties": "Shuttle driver will pick up workers , take them to worksite ,field walk, and drive workers back to their housing. They will also assist with timekeeping ,fill water jugs with drinking water for the workers in the morning, and ensure field sanitation measures are maintained through the day . They are required to live in the housing provided by the employer and take workers once a week to cash checks and to the grocery store. The workers will work in WATERMELON- Perform manual labor to hand cut wa...",
    "job_index": 38
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "migoharvesting69@gmail.com",
    "experience_required": "No",
    "company": "Migo Harvest, Inc",
    "location": "Pavo, GA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+14197700183",
    "caseNumber": "H-300-25150-033867",
    "job_duties": "Workers will perform assign duties as instructed by their supervisor. Planting of vegetables: A tractor will go over the fields making holes for the plants, workers will grab a tray of plants from the truck, walking down the rows the worker will put one plants per hole, when finish with the tray, the worker will walk back to the truck and grab another tray of plants, repeating the process through the work day. Harvesting vegetables: Once at the picking location, doing a row at a time, workers wi...",
    "job_index": 42
  },
  {
    "jobTitle": "General Laborer",
    "recApplyEmail": "cyberscreensusa@gmail.com",
    "experience_required": "No",
    "company": "Cyber Screen and Repairs LLC",
    "location": "Port St Lucie, FL",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19542564323",
    "caseNumber": "H-400-25135-978042",
    "job_duties": "Assist with the removal, repair of screens on the screen enclosures for patios, pool enclosures, and other structures. Use hand and power tools to complete tasks safely and efficiently. Load and unload materials, tools, and equipment for each job. Perform job site preparation and cleanup, ensuring a safe and organized workspace. Assist in lifting, carrying, and assembling materials as directed by the supervisor. Work outdoors in varying weather conditions and perform physically demanding tasks. ...",
    "job_index": 43
  }
]