[
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "ksugarfarms@yahoo.com",
    "experience_required": "Yes",
    "company": "Paul Schexnayder Farms",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257181116",
    "caseNumber": "H-300-25149-031348",
    "job_duties": "General worker corn, farm animals, grain, hay, milo, pasture, ryegrass, soybeans, sugarcane, wheat farm. Work includes tractor driving, field prep, water maint, fertilize, prepare, cultivate, plant, harvest of crops. Field prep includes operating farm equipment, manual shovel work, cleaning drains with shovel and hoeing of weeds, spot spray and gen farm labor. Help repair/maintain animals, barns, bins, bldgs, corrals, ditches, equip, farm, fences, field, grounds, levees, pastures, ponds, propert...",
    "job_index": 1
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "cpmgrowers@yahoo.com",
    "experience_required": "Yes",
    "company": "CPM Growers, LLC.",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257180892",
    "caseNumber": "H-300-25149-031233",
    "job_duties": "General farm worker needed for soybean and sugarcane farming. Work includes operating of farm equipment, vehicles, operating of tractors, tractor drawn machinery and self-propelled machinery used to plow, till, harrow, apply fertilizer, herbicides and pesticides to crops; plant, cultivate, and harvest of crops by hand or machine. Cut sugarcane with machetes into segments, load wagons with sugarcane stalks. May work in groups to hand plant sugarcane in furrows while walking/following moving wagon...",
    "job_index": 2
  },
  {
    "jobTitle": "Orchard Laborer",
    "recApplyEmail": "philip@appalachianorchard.com",
    "experience_required": "Yes",
    "company": "Appalachian Orchard Company",
    "location": "martinsburg, WV",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13049014388",
    "caseNumber": "H-300-25149-031240",
    "job_duties": "Manually plant, cultivate, and harvest fruit and vegetables including; cherries, strawberries, apples, pears, peaches, nectarines, plums, blueberries, blackberries, raspberries, grapes, corn, beans, tomatoes, peppers, eggplants, squash, cucumbers, melons, okra, and pumpkins. Use hand tools, such as, shovels, trowels, hoes, tampers, pruning hooks and shears, knives, hammers, and saws. Duties including manually cultivating all the different crops, hand thinning of any of the different crops, pruni...",
    "job_index": 3
  },
  {
    "jobTitle": "General Farm Worker",
    "recApplyEmail": "billybobs2@verizon.net",
    "experience_required": "Yes",
    "company": "Minick Ranch",
    "location": "Argyle, TX",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19404640434",
    "caseNumber": "H-300-25156-057196",
    "job_duties": "Cattle and Livestock work, irrigation, hayfield mowing and baling. Workers will care for cattle and other livestock including feeding, breeding and weaning. Workers will mow and bale hayfields and move hay bales. Feed and water livestock, supervise birth and weaning of livestock, maintain clean livestock facilities. Pick up hay in field and move to storage facilities. Provide irrigation for pastures and crops, maintain fences and safe holding facilities.",
    "job_index": 4
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "tsp829@cox.net",
    "experience_required": "Yes",
    "company": "Purpera Farms, LLC",
    "location": "Plaquemine, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257764364",
    "caseNumber": "H-300-25154-047896",
    "job_duties": "General worker needed for sugarcae farming. Work includes tractor driving, field prep, water maint, fertilize, plant and harvest of crops. Field prep includes operate farm equipment, manual shovel work, cleaning drains with shovel and hoeing of weeds, spot spray and gen farm labor. Help repair and maintain buildings, equip, farm, fences, field, levees, ponds, properties, roads and shop. Load and unload trucks. Worker must be able to lift/carry 50 lbs. M-F, some Sat/Sun, work in excess of 40 hour...",
    "job_index": 5
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Stock Farms Agricultural Association",
    "location": "Hollandale, MS",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25164-091223",
    "job_duties": "Participate in the inspection, grading, sorting, storage, and post-harvest treatment of crops such as working with grain bins and augers; Repair and maintain farm vehicles, implements, and mechanical equipment; Set up, repair, maintain, and operate irrigation equipment; Operate tractors, tractor-drawn machinery, and self-propelled machinery (much of which is equipped with GPS) such as planter, tillage tool to plow, harrow and fertilize soil, or to plant, cultivate, spray and harvest crops such a...",
    "job_index": 6
  },
  {
    "jobTitle": "Farmworkers and Laborers",
    "recApplyEmail": "michelle@cggamez.com",
    "experience_required": "Yes",
    "company": "ALTA Citrus, LLC (MI Apples #1)",
    "location": "Conklin, MI",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18634521230",
    "caseNumber": "H-300-25162-080303",
    "job_duties": "The job requires a minimum of three months experience in tasks associated with farm experience. The job requires extensive standing and walking. Workers are frequently required to use their hands and arms to handle, feel, reach, climb or balance. Workers are occasionally required to stoop, kneel, crouch, or crawl under trellis wires. Workers must be able to lift/carry up to 60 lbs. throughout the course of the day. Thinning: Thinning is a manual process used as part of orchard maintenance to con...",
    "job_index": 7
  },
  {
    "jobTitle": "General Farm Worker",
    "recApplyEmail": "toridunham95@outlook.com",
    "experience_required": "Yes",
    "company": "Dunham Brothers Farms, LLC.",
    "location": "Batchelor, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257185003",
    "caseNumber": "H-300-25154-047153",
    "job_duties": "General worker needed for corn, milo, soybean, and sugarcane farm. Work includes operating farm equipment, operate tractor, tractor drawn machinery and self propelled machinery to plow, harrow, and fertilize soil, and/or to plant, cultivate, spray, harvest by hand or machine, along with field prep, and water maint. Field prep includes manual shovel work and hoeing of weeds, spot spray and gen farm labor. Load field wagons with sugarcane stalk pieces, Walk behind wagon and plant by hand sugarcane...",
    "job_index": 8
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "seasonaljobs@crewhub.pro",
    "experience_required": "Yes",
    "company": "Mabela Farm Co. Inc.",
    "location": "Tripp, SD",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16057701691",
    "caseNumber": "H-300-25156-055658",
    "job_duties": "The worker will assist in seasonal grain farming operations on a 3,000-acre crop farm producing corn, soybeans, and wheat. Core duties include operating tractors with grain carts, combines, and driving farm trucks (local routes only—CDL not required) to haul grain from the field to on-farm storage or nearby elevators. The worker may also perform basic maintenance on machinery, including oil and filter changes, and may occasionally assist with hog chores, such as checking feeders and water system...",
    "job_index": 9
  },
  {
    "jobTitle": "Farmworker",
    "recApplyEmail": "barb@pinetreeappleorchard.com",
    "experience_required": "Yes",
    "company": "Pine Tree Apple Orchard",
    "location": "White Bear Lake, MN",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16514296577",
    "caseNumber": "H-300-25155-050838",
    "job_duties": "Manually plant, cultivate, and harvest produce. Use hand tools, shovels, hoes, tampers, brooms, rakes, pruning shears, and ladders. Clean, pack, sort, slice, box, load and transport harvested products. Maintain trellis and fences. Participate in irrigation activities for all crops. Set up and operate, maintain equipment, vehicles, tractors, forklifts and tractor drawn machinery, ie, spreaders, mowers, plows, cultivators, disks. Work with small engine equipment. Maintain buildings and grounds. As...",
    "job_index": 10
  },
  {
    "jobTitle": "Cotton Operator",
    "recApplyEmail": "erikaguerrero16@gmail.com",
    "experience_required": "Yes",
    "company": "Erika Guerrero",
    "location": "Surrency, GA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19128506162",
    "caseNumber": "H-300-25162-080562",
    "job_duties": "Workers will be preparing the cotton gin for the new cotton season. The workers will operate and service machinery to ensure all equipment is ready to start the season. Workers will perform general maintenance, adjust, repair, and service machinery, and notify supervisors of malfunctions, upkeep, and clean equipment to ensure the machinery is ready to operate and control farm equipment to support agricultural activities. Perform daily inspections on critical components like belts, bearings, and ...",
    "job_index": 11
  },
  {
    "jobTitle": "Farmworker",
    "recApplyEmail": "dcalleros@westernag.com",
    "experience_required": "Yes",
    "company": "WAG Services, Inc. - NE",
    "location": "BERTRAND, NE",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16239074034",
    "caseNumber": "H-300-25153-039535",
    "job_duties": "Crops/Commodities: Install and/or replace hay/silage tarps, livestock shade cloths, and covers in feed yards and other farm locations. Load/unload, lift, carry, and fold/unfold tarps. Cover agricultural products and/or livestock with tarps and covers. Use top straps to secure tarps from wind. Use draw straps, ropes, and/or buckle assemblies to secure the tarp to stacks. Work must be performed carefully to prevent harm to products or animals. All tarps and covers must be secured properly to preve...",
    "job_index": 12
  },
  {
    "jobTitle": "Farmworkers, Farm & Ranch Animals",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "HR Feeders",
    "location": "Towner, ND",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25168-102226",
    "job_duties": "Help protect cattle from winter elements such as sleet, snow, ice, freezing temperatures; move snow; freshen pens to protect against cold stress; ensure that water troughs are thawed and clean, prevent slippery areas; replace bedding as necessary to avoid contamination and disease; distribute feed to cattle; drive equipment such a tractor with feed wagon; mix and grind in prescribed portions; assist with birthing; repair and maintain buildings, fences, and other structures such as corrals, feedi...",
    "job_index": 13
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "caineliseo@hotmail.com",
    "experience_required": "Yes",
    "company": "Rivera Evergreens, Inc.",
    "location": "Ennice, NC",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18639904910",
    "caseNumber": "H-300-25161-074791",
    "job_duties": "Workers will harvest white pine tips and Pumpkins as instructed by their supervisor. White Pine Tips: The worker will take a burlap bag from the field truck to the particular area of the field where the tips will be harvest. Worker positions him/herself in front of the white pine tree and will remove the tips from the tree and place them into the burlap bag taking care not to damage the tips or damage the tree. When the burlap bag is full he will take it to the end of the row where he will place...",
    "job_index": 14
  },
  {
    "jobTitle": "Cooks, Institution, Cafeteria",
    "recApplyEmail": "forrenceorchardsjobs@gmail.com",
    "experience_required": "Yes",
    "company": "Forrence Orchards, Inc",
    "location": "Peru, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15186439527",
    "caseNumber": "H-300-25166-094199",
    "job_duties": "All applicants must be able, willing and qualified to perform the work as described in the job order and must be available for the entire period of employment specified in Section A. Box 3 & 4. This work order is for qualified people to prepare and cook family-style meals for approximately 174 workers in a bunkhouse. Workers will be asked to: cook food and plan daily menus; wash dishes; bake breads and pastries; order and shop for food and supplies; store food in designated areas, utilizing know...",
    "job_index": 15
  },
  {
    "jobTitle": "Agricultural Equipment Operator",
    "recApplyEmail": "SCHWABSFARM@HOTMAIL.COM",
    "experience_required": "Yes",
    "company": "SCHWAB FARM LLC",
    "location": "GASPORT, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17167357570",
    "caseNumber": "H-300-25167-095229",
    "job_duties": "Operate trucks or other multi-purpose vehicles to transport workers from housing (whether on or off farm) to the farm properties; haul tools, supplies, or crops; transport workers from place to place around the farm properties during the workday (including on public roads to reach farmer?s fields and/or transport workers to the grocery store, or bank on an as-needed basis. Load agricultural products into trucks, and drive trucks to market or storage facilities. Not all workers are requested to d...",
    "job_index": 16
  },
  {
    "jobTitle": "Farmworker: Diversified",
    "recApplyEmail": "contact@speacialtycroph2a.com",
    "experience_required": "Yes",
    "company": "Specialty Crop Farm Labor Contractors, LLC",
    "location": "Poultney, VT",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17166640408",
    "caseNumber": "H-300-25162-081452",
    "job_duties": "Workers will perform fall harvest-associated work in a vineyard as well as a sweet potato operation. See addendum more details.",
    "job_index": 17
  },
  {
    "jobTitle": "Range Sheepherder",
    "recApplyEmail": "benansolabehere@gmail.com",
    "experience_required": "Yes",
    "company": "Ansolabehere Sheep Co.",
    "location": "Bakersfield, CA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "1-866-4-USA-DOL",
    "caseNumber": "H-300-25167-097926",
    "job_duties": "Required to be available up to 24 hours per day, 7 days a week and spend the majority of workdays on the range. All job duties are closely and directly related to the production of sheep. Perform any combination of the following tasks to attend sheep on the range: administer emergency minor medical care to sick/injured pregnant ewes using roping methods to gently immobilize animal without causing undue stress; apply herbicides to noxious, invasive and poisonous plant species on grazing areas; as...",
    "job_index": 18
  },
  {
    "jobTitle": "Farmworker/laborer",
    "recApplyEmail": "krafarms@yahoo.com",
    "experience_required": "Yes",
    "company": "KRA Farms, LLC",
    "location": "Vardaman, MS",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16624141154",
    "caseNumber": "H-300-25164-087761",
    "job_duties": "Workers will be working in greenhouses potting, pruning and weeding tomato plants. Workers will then clean the greenhouse to prepare to start potting, weeding, cutting and transplanting sweet potato slips for harvesting. Workers will also wash produce and repair wood bins for harvested produce, and package produce in packing house. Workers must have 3 months experience in cultivating hot house tomatoes from seed. This is a seasonal position, greenhouse work is only available from September until...",
    "job_index": 19
  },
  {
    "jobTitle": "Farmworker, Laborer",
    "recApplyEmail": "edwinpell77@gmail.com",
    "experience_required": "Yes",
    "company": "P & P Farms, Inc.",
    "location": "Frenchville, ME",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12075437707",
    "caseNumber": "H-300-25169-105609",
    "job_duties": "Workers will perform general farm duties to include servicing machines and equipment such as welding fabrication, tire changing, greasing of equipment, as well as stacking bags of potatoes, pressure washing, cleaning and maintaining buildings, picking rocks and stacking firewood. Workers should have 3 months experience in servicing farm equipment.",
    "job_index": 20
  },
  {
    "jobTitle": "Range Lamber",
    "recApplyEmail": "elgorriagajulia@gmail.com",
    "experience_required": "Yes",
    "company": "GOLDEN VALLEY SHEEP COMPANY LLC",
    "location": "MADERA, CA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15597064990",
    "caseNumber": "H-300-25168-102027",
    "job_duties": "Worker must have at least 3 months experience birthing livestock with herds of 200 or more on the open range. One reference required. May assist in lambing, docking, shearing and branding. The following seasonal duties will need to be performed. Be able to identify signs of ewes going into labor and identify potential problems during the labor process. Know when and how to assist during difficult births. Be able to constrain ewes for difficult births and able to graft orphan lambs to mothers. Be...",
    "job_index": 21
  },
  {
    "jobTitle": "Farmworkers & Laborers, Crop, Nursery, Greenhouse",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Jolly Rancher Trucking LLC",
    "location": "Pocahontas, AR",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25162-081096",
    "job_duties": "Manually use hand tools such as shovels, scoops, brooms for duties such as auguring grain, scooping grain, turning levers and knobs to dry grain, sweep bins with hand broom after grain is augured; Load agricultural products including corn, rice, soybeans, hay, mixed grain into trucks without over or under filling and drive trucks to market or storage facilities; Operate tractors, tractor-drawn machinery, self-propelled machinery to plant, cultivate, spray and harvest crops; Operate, repair irrig...",
    "job_index": 22
  },
  {
    "jobTitle": "Graders and Sorters",
    "recApplyEmail": "cvapple@aol.com",
    "experience_required": "Yes",
    "company": "Champlain Valley Apple Storage Inc",
    "location": "Peru, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15186438221",
    "caseNumber": "H-300-25166-094217",
    "job_duties": "All applicants must be able, willing and qualified to perform the work described in the job order and must be available for the entire period of employment specified in Section A. Box 3 & 4. This work order is for qualified people to perform any combination of task related to packing fresh market apples including, but not limited to, operating apple grading equipment, labelers and baggers; adjusting, maintaining and cleaning packing machines; folding cardboard containers; grade and sort by hand,...",
    "job_index": 23
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "schuchmann417@gmail.com",
    "experience_required": "Yes",
    "company": "Schuchmann Farms, LLC",
    "location": "Billings, MO",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+14174149689",
    "caseNumber": "H-300-25163-084043",
    "job_duties": "Work with cattle. Feed, administer medication, monitor health for signs of sickness, assist with calving, perform artificial insemination and manage waste. Maintain fencing as needed. General farm maintenance including but not limited to mowing, bushhogging, weed eating. Cutting and baling hay and/or other forage for use as feed. Planting grazing plots. Maintain farm equipment and facilities including performing repairs as necessary. Operate equipment including tractors, lawn mowers, and other m...",
    "job_index": 25
  },
  {
    "jobTitle": "Range Winter Sheepherder",
    "recApplyEmail": "shetlend@yahoo.com",
    "experience_required": "Yes",
    "company": "GRANT AZEVEDO",
    "location": "MAXWELL, CA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15305153613",
    "caseNumber": "H-300-25168-101879",
    "job_duties": "Must have 3 months experience with 800 - 1000 head flocks. One reference required. The employee must be able to identify approaching storm periods and make precautions to prevent the herd from drifting against a fence line where they pile up and get drifted over with snow and freeze to death. The herder must be experienced in handling extreme winter conditions on a range to prevent death in sheep, horses, and dogs. Due to sheep exerting more energy during the winter months especially in extreme ...",
    "job_index": 26
  },
  {
    "jobTitle": "Farmworker: Diversified (45-2092.00)",
    "recApplyEmail": "applicants22366@gmail.com",
    "experience_required": "Yes",
    "company": "Conrow Farms",
    "location": "Brockport, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15857526074",
    "caseNumber": "H-300-25167-096121",
    "job_duties": "Workers will perform all tasks involved in the growing and harvesting of crops. Crops include Apple, Winter Squash, Hay, Soybeans. Sanitation Requirements: For food and general personal safety purposes, all workers will be required and expected to follow common sanitary practices at all times. This is particularly critical when hand harvesting crops for human consumption. Employees are required to cleanse their hands by washing them thoroughly with soap and water after using the bathroom and bef...",
    "job_index": 29
  },
  {
    "jobTitle": "Agricultural Worker",
    "recApplyEmail": "Lakevilleh2a@gmail.com",
    "experience_required": "Yes",
    "company": "Lakeville Orchards Inc.",
    "location": "Williamson, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15857661185",
    "caseNumber": "H-300-25168-100108",
    "job_duties": "Summer Prune trees, harvest apples, orchard maintenance, bin repair, hand thinning, planting trees, picking up roots & rocks, operate trucks or other multi-purpose vehicles to transport workers from housing (weather on or off the farm) to the farm properties; haul tools, supplies, or crops; transport workers from place to place around the farm properties during the workday (including on public roads to reach the farm fields); and/or transport workers to the grocery store, bank, or laundry facili...",
    "job_index": 30
  },
  {
    "jobTitle": "Agricultural Equipment Operator",
    "recApplyEmail": "timlisaschilke@gmail.com",
    "experience_required": "Yes",
    "company": "TL Schilke Enterprises, Inc.",
    "location": "Lamar, NE",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13088825709",
    "caseNumber": "H-300-25167-095791",
    "job_duties": "We farm 10,000 acres of corn, wheat, and soybeans in southwestern Nebraska. It is mostly an irrigated farm with some dryland. We farm in Nebraska and Colorado as we live four miles from the Colorado state line. We have newer John Deere equipment and modern shops and practices. We utilize GPS in our tractors and also track pivot sprinklers this way. Employees will need to know how to drive a semi for corn harvest, but do not have to have a CDL because we do not travel more than 150 miles from the...",
    "job_index": 31
  },
  {
    "jobTitle": "Winter Range Goat/sheepherder",
    "recApplyEmail": "ebrough2@yahoo.com",
    "experience_required": "Yes",
    "company": "BELL BRAND CATTLE COMPANY LLC",
    "location": "RYAN, OK",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "1-866-4-USA-DOL",
    "caseNumber": "H-300-25168-101803",
    "job_duties": "Required to be available up to 24 hours per day, 7 days a week and spend the majority of workdays on the range. Worker must have 4 months experience. All job duties are closely and directly related to the production of sheep. Perform any combination of the following tasks to attend to sheep on the range during the winter season: administer emergency minor medical care to sick/injured pregnant ewes using roping methods to gently immobilize animal without causing undue stress; assist with hauling ...",
    "job_index": 34
  },
  {
    "jobTitle": "Orchard Worker",
    "recApplyEmail": "teeplefarmsh2a@gmail.com",
    "experience_required": "Yes",
    "company": "Teeple Farms, Inc.",
    "location": "North Rose, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13155871053",
    "caseNumber": "H-300-25167-095419",
    "job_duties": "Crops/Commodities: apples. This job requires a minimum of 3 months of agricultural field work experience handling tasks. Applicants must be able to furnish verbal or written statement establishing relevant prior work experience. Workers must be able to perform manual as well as mechanized activities with accuracy and efficiency. Quality is essential. Fruit is spot picked for fresh market and processing. Workers will be directed to strip all fruit from tree at one picking or to spot pick (selecti...",
    "job_index": 35
  },
  {
    "jobTitle": "Agricultural Equipment Operators",
    "recApplyEmail": "seasonaljobs@blackgoldfarms.com",
    "experience_required": "Yes",
    "company": "Black Gold Farms Inc",
    "location": "Camden, NC",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17014022878",
    "caseNumber": "H-300-25163-087248",
    "job_duties": "1. Load and unload crops or containers of materials, manually or using conveyors, handtrucks, forklifts, or transfer augers. 2. Observe and listen to machinery operation to detect equipment malfunctions. 3. Manipulate controls to set, activate, and adjust mechanisms on machinery. 4. Weigh crop-filled containers, and record weights and other identifying information. 5. Drive trucks to haul crops in accordance with proper safety standards. 6. Drive along the side of harvesting equipment in the fie...",
    "job_index": 36
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Boehning Dairy LLC",
    "location": "Earth, TX",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25163-086830",
    "job_duties": "Operate tractors, tractor-drawn machinery, and self-propelled machinery (much of which is equipped with GPS) to plow, harrow and fertilize soil, or to plant, cultivate, spray and harvest crops; Set up, operate, and repair irrigation equipment; Repair and maintain farm vehicles, implements, and mechanical equipment; Load agricultural products into trucks without over or underfilling bed or trailer, and drive to market or storage facilities; Clean work areas and maintain grounds and landscaping; R...",
    "job_index": 37
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "bennettfarm0@gmail.com",
    "experience_required": "Yes",
    "company": "Bennett Grain & Livestock Inc.",
    "location": "Greensburg, IN",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18127160486",
    "caseNumber": "H-300-25164-091368",
    "job_duties": "Load and unload crops or containers of materials, manually or using conveyors, handtrucks, forklifts, or transfer augers. Mix specified materials or chemicals, and dump solutions, powders, or seeds into planter or sprayer machinery. Spray fertilizer or pesticide solutions to control insects, fungus and weed growth, and diseases, using hand sprayers. Observe and listen to machinery operation to detect equipment malfunctions. Manipulate controls to set, activate, and adjust mechanisms on machinery...",
    "job_index": 39
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "jakecorn1@wctatel.net",
    "experience_required": "Yes",
    "company": "Jakes Sweet Corn LLC",
    "location": "Thompson, IA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16414258967",
    "caseNumber": "H-300-25168-100098",
    "job_duties": "Load and unload crops or containers of materials, manually or using conveyors, handtrucks, forklifts, or transfer augers. Observe and listen to machinery operation to detect equipment malfunctions. Manipulate controls to set, activate, and adjust mechanisms on machinery. Operate or tend equipment used in agricultural production, such as tractors, combines, and irrigation equipment. Maintain farm machinery and notify supervisors when machinery malfunctions. Attach farm implements such as plows, d...",
    "job_index": 40
  },
  {
    "jobTitle": "Equipment Operator",
    "recApplyEmail": "seasonaljobs@crewhub.pro",
    "experience_required": "Yes",
    "company": "Jeff Borgen Farm",
    "location": "Perley, MN",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12187907945",
    "caseNumber": "H-300-25140-996820",
    "job_duties": "Farm Machinery Operation: Drive and operate farm machinery to cultivate, plant, harvest, and store grain crops. Attach and detach farm implements such as plows, discs, and drills to tractors. Set up, calibrate, and optimize equipment to perform operations as needed. Equipment Maintenance: Perform general lubrication and service checks (e.g., check fluids) on farm machinery. Conduct mechanical repairs to ensure machinery operates efficiently. Transportation: Transport produce, water, and supplies...",
    "job_index": 41
  },
  {
    "jobTitle": "Livestock Worker",
    "recApplyEmail": "asabennett27@icloud.com",
    "experience_required": "Yes",
    "company": "Caldwell Land & Timber",
    "location": "Greenwood, MS",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16622070034",
    "caseNumber": "H-300-25154-043827",
    "job_duties": "Job requires tending to livestock in the forms of feeding, examining, tagging, herding, checking livestock, assisting with medication administration and vet visits, managing hay and providing it to the livestock as feed, mixing feed daily, ensuring water sources are not iced over, artificially inseminating heifers, moving portable corrals as required, calving cows and bred heifers, occasionally lifting and carrying newborn calves, and weaning calves from cows. Job also requires operating various...",
    "job_index": 44
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "cpmgrowers@yahoo.com",
    "experience_required": "Yes",
    "company": "CPM Growers, LLC.",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257180892",
    "caseNumber": "H-300-25149-031258",
    "job_duties": "General farm worker needed for soybean and sugarcane farming. Work includes operating of farm equipment, vehicles, operating of tractors, tractor drawn machinery and self-propelled machinery used to plow, till, harrow, apply fertilizer, herbicides and pesticides to crops; plant, cultivate, and harvest of crops by hand or machine. Cut sugarcane with machetes into segments, load wagons with sugarcane stalks. May work in groups to hand plant sugarcane in furrows while walking/following moving wagon...",
    "job_index": 45
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "jan_liveoakplanting23@yahoo.com",
    "experience_required": "Yes",
    "company": "Live Oak Planting, Inc.",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257183544",
    "caseNumber": "H-300-25149-031170",
    "job_duties": "General worker needed for soybeans and sugar cane. Work includes driving farm machinery, the operation of tractors, tractor-drawn machinery, and self-propelled machinery used for plowing, tilling, harrowing, applying fertilizers, herbicides, and pesticides to crops; plant, cultivate and harvest crops. Cut the sugar cane with machetes into segments, load the wagons with sugar cane stalks. May work in groups to plant sugarcane in rows while walking/following moving cart. Field preparation includes...",
    "job_index": 46
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "h2a@mytacres.com",
    "experience_required": "Yes",
    "company": "My-T Acres, Inc.",
    "location": "Batavia, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15853431026",
    "caseNumber": "H-300-25143-013961",
    "job_duties": "Crops including but not limited to: Beans, beets, cabbages, carrots, corn, green beans, oats, potatoes, wheat, sweet corn, rye, onions. Manually pick/lift/carry stones from fields to truck/loader/woods to clear fields. Cut, chop, and/or pull weeds or vines, pick up wood, sticks, and/or stones from fields or hedgerows. Manually hand and/or machine plant cabbage or onion plants. May walk behind machine planter and cover transplanted cabbage or onion plugs. May ride mechanical transplanter and load...",
    "job_index": 47
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "aespinosa@agrality.com",
    "experience_required": "Yes",
    "company": "Agrality, Inc.",
    "location": "Lafayette, IN",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17656397045",
    "caseNumber": "H-300-25153-043131",
    "job_duties": "General farm labor, including, but not limited to: self-pollination, hand cross pollination, leaf sampling, tagging, hand detasseling, hand harvesting, hoeing, shelling, bogging, and seed cleaning. Drive and operate farm machinery such as tractors, ATVs, and self-propelled machinery to till soil, prepare fields, and plant crops. Set up and operate irrigation equipment, including laying pipes, maintaining ditches, and ensuring adequate water supply to crops. Apply fertilizers, herbicides, and pes...",
    "job_index": 48
  },
  {
    "jobTitle": "Livestock Worker",
    "recApplyEmail": "brendonparkman@gmail.com",
    "experience_required": "Yes",
    "company": "Parkman Land and Cattle, Inc.",
    "location": "Mathews, AL",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13343032535",
    "caseNumber": "H-300-25167-098530",
    "job_duties": "Job requires the operation of various tractors and farm equipment to tend to cattle, harvest hay, bale hay, maintain farm grounds, and transport cattle. Equipment that workers may be required to operate includes, but is not limited to, tractors with various implements, sprayers, mowers, skid steers, catch pens, chainsaws, ATVs, UTVs, feed trucks, and pickup trucks with stock trailers. Job also requires feeding and watering livestock, mixing feed, lifting bags of mineral and hay bales, putting ou...",
    "job_index": 49
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "bonesmb@aol.com",
    "experience_required": "Yes",
    "company": "Amore Farms",
    "location": "Marion, AR",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19013015923",
    "caseNumber": "H-300-25149-028752",
    "job_duties": "Drive and operate farm machinery such as tractors, ATVs, and self-propelled machinery to till soil, prepare fields, and plant crops; Perform mechanical repairs and maintenance on farm vehicles, implements, and equipment; Set up and operate irrigation equipment, including laying pipes, maintaining ditches, and ensuring adequate water supply to crops; Apply fertilizers, herbicides, and pesticides to crops using hand sprayers and other equipment; Conduct regular crop inspections to monitor growth, ...",
    "job_index": 50
  }
]