[
  {
    "jobTitle": "Farmworker/laborers",
    "recApplyEmail": "sgmsjobs@allanbrosfruit.com",
    "experience_required": "Yes",
    "company": "Sagemoor Group Management Services, Inc.",
    "location": "Pasco, WA",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+15095472533",
    "caseNumber": "H-300-25146-017788",
    "job_duties": "Job Description and Requirements Primary tasks will be thinning, leafing planting, training and trellising trees, summer pruning and harvesting of apples, pears, cherries and wine grapes. General - workers will perform any of the following duties: Orchard clean-up, building and repairing tree trellises, spreading compost, removal of strings and wire from trellises and other hand tasks. Care of young non-producing fruit trees, including weeding, tree trunk painting, hand fertilizing and hand clip..."
  },
  {
    "jobTitle": "Shuttle Drivers/chauffeurs",
    "recApplyEmail": "h2ag3harvesting@gmail.com",
    "experience_required": "Yes",
    "company": "GIII HARVESTING, LLC",
    "location": "Atlanta, IN",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+18632346103",
    "caseNumber": "H-300-25143-010880",
    "job_duties": "Workers will perform duties as instructed and assigned by their supervisor. Shuttle Bus Driver: Inspect vehicle and safety equipment on bus before driving. Pick up workers at hotel/living quarters and transport workers to work site. Report any accidents/injuries. Keep vehicle clean, transfer workers from one worksite to another when necessary. Provide documents/licenses to federal agencies when requested. Transport workers back to hotel at the end of the workday. Operating a company vehicle duri..."
  },
  {
    "jobTitle": "Farmworkers and Laborers",
    "recApplyEmail": "ramirez_charlie239@yahoo.com",
    "experience_required": "Yes",
    "company": "Florida Melon & Field Pros Harvesting Corp",
    "location": "Hornersville, MO",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+18634443968",
    "caseNumber": "H-300-25135-979854",
    "job_duties": "The farm worker position includes duties associated with the harvesting and packing of watermelons. This work can require standing, walking, stooping, bending, and lifting up to 60 pounds for long periods of time outdoors in all weather conditions. It also includes making important decisions based on size, coloring, and ripeness according to prescribed standards. This work requires adherence to important food safety and quality standard operating procedures and the ability to work quickly and co..."
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Ellis Farm and Ranch",
    "location": "La Ward, TX",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25162-082221",
    "job_duties": "We have a farming and ranching operation where we grow cotton, corn and turf sod. We need seasonal employees to assist with all aspects of growing these crops and working on our ranch. Employees will need to operate farm equipment including tractors to plant, raise and harvest these crops. Each day duties will include harvesting sod and loading it. Once daily sod harvest is completed, you may also perform additional duties such as mowing, repairing pallets, organizing the field, irrigation, serv..."
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "mrodriguez01974718@gmail.com",
    "experience_required": "Yes",
    "company": "Morquecho Produce, LLC",
    "location": "Bethel, DE",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+14782907512",
    "caseNumber": "H-300-25113-896540",
    "job_duties": "Sorting/Grading potatoes: Potatoes will be harvested by machine and put in a conveyor belt; workers will stand by the conveyor belt and sort the potatoes by size and quality at the same time workers will need to remove debris. Potatoes packing: Trucks will take the harvested potatoes to the packing house which is located inside the farm, workers will pick out the potatoes that will be used for seed the rest of the potatoes will be separated by size, labeled and packed. Harvesting melon by hand, ..."
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "twojmproducellc@yahoo.com",
    "experience_required": "No",
    "company": "2JM Produce LLC",
    "location": "Lubbock, TX",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+19562669056",
    "caseNumber": "H-300-25122-933963",
    "job_duties": "Employees will need to cut and grade #1 watermelons in the field and be able to load and pack the watermelons,pumkins and cantolope and get ready to ship. Daily work hours may vary based on operational needs. Workers may be requested, but not required, to work on Sundays and holidays."
  },
  {
    "jobTitle": "Agricultural Equipment Operator",
    "recApplyEmail": "colbyfrerich@gmail.com",
    "experience_required": "No",
    "company": "Sugar Square Farms",
    "location": "Hereford, TX",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+18066561178",
    "caseNumber": "H-300-25162-079894",
    "job_duties": "Assist with daily farm functions including but not limited to the following: Operate various farm equipment (combines, tractors, trucks, etc.) for planting, spraying, cultivating, fertilizing, and harvesting of crops. Grain handling, hauling farm commodities. Load/unload trucks. May involve climbing ladders, grain bins etc. Maintain/repair machinery. This job involves manual labor, lifting, carrying, bending, and long days in the heat and cold. Rain days are typically spent in the shop repairing..."
  },
  {
    "jobTitle": "Hay Farm/livestock Worker",
    "recApplyEmail": "cachristensen0514@gmail.com",
    "experience_required": "Yes",
    "company": "CR Lazy Ranch",
    "location": "Lyman, UT",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "N/A",
    "caseNumber": "H-300-25162-078769",
    "job_duties": "All job duties are closely and directly related to the production of hay and livestock. The larger percentage of the work activities will be related to general farmwork/irrigation/hay production. Perform any combination of the following tasks required in general farmwork and the production of hay: adjust alignment of pipes ; adjust gates and pipe connections to control water flow; adjust valves to start and/or adjust water flow; apply medications to cuts and bruises; assemble and place pipe in a..."
  },
  {
    "jobTitle": "Farmworkers, Farm & Ranch Animals",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Waters Cattle",
    "location": "Meade, KS",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25163-084693",
    "job_duties": "Our farm consists of about 5000 acres of farm ground, about half sprinkler irrigated and half dryland. Crops are primarily corn, soybeans, milo, wheat and a small amount of alfalfa. We operate 18 Valley pivots and 11 irrigation wells. We also operate around 6700 acre of native grass which we run 300 to 350 cow/calf pairs on. Equipment is all later model Deere. Job duties may include and are not limited to tasks such as: apply products such as fertilizers, pesticides, growth inhibitors, etc; atta..."
  },
  {
    "jobTitle": "Ag Equipment Operator",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Adam Shimek Farms",
    "location": "Garwood, TX",
    "salary": "$19.82 per hour",
    "begin_date": "6/22/2025",
    "end_date": "11/15/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25153-042586",
    "job_duties": "We need additional assistance with our rice and farming operation to help with operating equipment, flooding and draining rice fields and other general farm operations. Tractor work, water hand, Tractor/vehicle maintenance, shop maintenance, mowing, Herbicide applicator spot sprayer Job duties may include and are not limited to tasks such as: apply products such as fertilizers, pesticides, growth inhibitors, etc; attach/detach implements; be able to handle working in high humidity; clean work ar..."
  }
]