[
  {
    "jobTitle": "Landscape Laborer",
    "recApplyEmail": "sarah@micksgrass.com",
    "experience_required": "No",
    "company": "Mick's Grass & Sod Service, Inc.",
    "location": "Crosby, TX",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+12818412158",
    "caseNumber": "H-400-25122-933992",
    "job_duties": "Mowing, weed trimming, and raking or clean-up of leaves with blowers. Also, installation, pruning and trimming of plants, trees, and shrubs. Placing and tilling dirt, mulch, compost, and sod. Installation of sprinkler systems. Installation of weed barriers and irrigation. General landscape labor using landscape equipment for landscape installation and maintenance. Loading and unloading of materials and equipment. Lifting required up to 50 pounds. Work performed on local area jobsites with employ...",
    "job_index": 3
  },
  {
    "jobTitle": "Nursery Worker",
    "recApplyEmail": "H2@mvncorp.com",
    "experience_required": "No",
    "company": "Moon Valley Nurseries",
    "location": "San Antonio, TX",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+16027816775",
    "caseNumber": "H-300-25136-987656",
    "job_duties": "Plant, grow, sell and install shade, ornamental and evergreen trees and other landscape plant material such as shrubs, annual and perennial plants, grasses, ground-covers and bulbs. Installing drip irrigation for plant stock. Building tree boxes and light vehicle maintenance. We provide tree trimming and removal, tree healthcare services and other landscape related tasks; digging holes with a shovel or trowel and installing plant material such as trees, shrubs, annual and perennial plants, groun...",
    "job_index": 5
  },
  {
    "jobTitle": "Nursery Worker",
    "recApplyEmail": "H2@mvncorp.com",
    "experience_required": "No",
    "company": "Moon Valley Nurseries",
    "location": "Knoxville, TN",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+14809205966",
    "caseNumber": "H-300-25094-831569",
    "job_duties": "Plant, grow, sell and install shade, ornamental and evergreen trees and other landscape plant material such as shrubs, annual and perennial plants, grasses, ground-covers and bulbs. Installing drip irrigation for plant stock. Building tree boxes and light vehicle maintenance. We provide tree trimming and removal, tree healthcare services and other landscape related tasks; digging holes with a shovel or trowel and installing plant material such as trees, shrubs, annual and perennial plants, groun...",
    "job_index": 13
  },
  {
    "jobTitle": "Ranch Hand",
    "recApplyEmail": "suzendennis@aol.com",
    "experience_required": "No",
    "company": "Tailwaggers Country Inn, Inc.",
    "location": "Van Alstyne, TX",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+19034820477",
    "caseNumber": "H-300-24365-577354",
    "job_duties": "Farm work/ranch hand for 34-acre livestock rescue and pet care resort: livestock care including feeding, watering, exercising and tending to medical needs; cut/harvest hay; plant feed for livestock; fence repair and maintenance; and daily property maintenance; operate and maintain tractors, lawn mowers and general landscape equipment. Follow all safety guidelines and protocols to ensure a safe working environment.",
    "job_index": 14
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "farmers@sweetroot.farm",
    "experience_required": "No",
    "company": "SweetRoot Farm, LLC",
    "location": "Hamilton, MT",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+14062401050",
    "caseNumber": "H-300-25048-699560",
    "job_duties": "Duties may include: Workers will assist in all stages of diversified vegetable crop production such as bed preparation involving spreading compost and organic amendments, broad forking, pulling perennial weeds, raking grounds, installing drip irrigation and landscape fabric, seeding and transplanting, irrigation including both drip irrigation and overhead irrigation, cultivation and weeding of crops, pruning and trellising of crops, harvesting, post-harvest handling of crops in wash/ pack proces...",
    "job_index": 17
  },
  {
    "jobTitle": "Nursery Laborer",
    "recApplyEmail": "rich@landscapetechnologygroup.com",
    "experience_required": "No",
    "company": "The Garden Center of Gypsum, LLC",
    "location": "Gypsum, CO",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+19705240138",
    "caseNumber": "H-300-25048-699653",
    "job_duties": "Cultivate and grow perennials, annuals and ornamentals for wholesale and retail customers. Weeding and watering of all cultivated material.",
    "job_index": 18
  },
  {
    "jobTitle": "Nursery Worker",
    "recApplyEmail": "mwolfhll@gmail.com",
    "experience_required": "No",
    "company": "The Mustard Seed",
    "location": "Chaska, MN",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "1-866-4-USA-DOL",
    "caseNumber": "H-300-25016-623826",
    "job_duties": "Perform general nursery work activities, including a combination of the following duties: harvest plants and transplant or pot and label them; set up and operate irrigation equipment; sell and deliver plants and flowers to customers; sow grass seed or plant plugs of grass; identify plants, pests and weeds to determine the selection and application of pesticides and fertilizers; regulate greenhouse conditions and indoor and outdoor irrigation systems; cut, roll and stack sod; feel plants' leaves ...",
    "job_index": 19
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop, Nursery, and Greenhouse",
    "recApplyEmail": "dctucker2@gmail.com",
    "experience_required": "No",
    "company": "All Around Lawn & Landscape Construction Services LLC",
    "location": "Brooksville, KY",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+16067825370",
    "caseNumber": "H-300-25034-660938",
    "job_duties": "Burley Tobacco: Duties to include, but not limited to: greenhouse care, setting, topping, oiling, cutting, housing and stripping. Workers will be trained for a period of two days (14 hours) after which the worker will be expected to cut 100 sticks per hour - does not include dropping sticks in field. Dark Fired Tobacco: Duties to include, but not limited to: greenhouse care, setting, topping, oiling, cutting, housing and stripping. Workers will be required to cut wood and carry to barn to fire t...",
    "job_index": 22
  },
  {
    "jobTitle": "Agricultural Equipment Operator",
    "recApplyEmail": "joehrobertsfarms@yahoo.com",
    "experience_required": "No",
    "company": "Bar J Farms & Cattle Inc",
    "location": "Mort, TX",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+18068935145",
    "caseNumber": "H-300-25013-613804",
    "job_duties": "The role involves a wide range of responsibilities that span both crop production and livestock management, requiring a combination of technical, mechanical, and animal care skills. Key duties include preparing fields for planting by using tractors and various farm implements such as plows, discs, and seed drills. The role also involves operating and maintaining machinery for planting, fertilizing, spraying, irrigating, and harvesting crops, including tractors, planters, sprayers, seed drills, a...",
    "job_index": 24
  },
  {
    "jobTitle": "Farmworkers & Laborers, Crop, Nursery, Greenhouse",
    "recApplyEmail": "jimpufferlandscape@gmail.com",
    "experience_required": "No",
    "company": "Jim Puffer Landscape Inc",
    "location": "Layton, UT",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "1-866-4-USA-DOL",
    "caseNumber": "H-300-25029-652110",
    "job_duties": "Jim Puffer Landscape Inc. has a 13-acre tree farm. Workers' duties include taking care of the existing trees; unloading newly delivered trees and plant material; planting trees and shrubs in fields; ensuring that trees and plants are watered and well taken care of; harvesting trees and plants; harvesting fruit from scores of peach, pear, plum, and apple trees; weeding; driving a tractor; loading and unloading trees; and tilling fields.",
    "job_index": 29
  },
  {
    "jobTitle": "Nursery Worker",
    "recApplyEmail": "H2@mvncorp.com",
    "experience_required": "No",
    "company": "Moon Valley Nurseries",
    "location": "Las Vegas, NV",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+14809205966",
    "caseNumber": "H-300-25024-642003",
    "job_duties": "***THIS ORDER IS TO REPLACE ORDER # JO-A-300-24337-510964 DUE TO AN INCORRECT WAGE RATE LISTED*** Plant, grow, sell and install shade, ornamental and evergreen trees and other landscape plant material such as shrubs, annual and perennial plants, grasses, ground-covers and bulbs. Installing drip irrigation for plant stock. Building tree boxes and light vehicle maintenance. We provide tree trimming and removal, tree healthcare services and other landscape related tasks; digging holes with a shovel...",
    "job_index": 30
  },
  {
    "jobTitle": "Nursery Worker",
    "recApplyEmail": "H2@mvncorp.com",
    "experience_required": "No",
    "company": "Moon Valley Nurseries",
    "location": "Bellflower, CA",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+14809205966",
    "caseNumber": "H-300-25013-613570",
    "job_duties": "Please note that our actual start date of need is 1/31/2025, however, our initial H-2A application was denied (H-300-24337-509973) because there was delay in obtaining an updated Certificate of Workers Compensation, requiring that we now re-file. Nursery Worker: The below duties are all performed at nursery and Moon Valley farm property locations in the Los Angeles-Long Beach-Anaheim, CA Metropolitan Statistical Area. Plant, grow, sell and install shade, ornamental and evergreen trees and other ...",
    "job_index": 36
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop, Nursery, and Greenhouse",
    "recApplyEmail": "blue.boy@att.net",
    "experience_required": "No",
    "company": "Blue Boy Lawn & Landscape LLC",
    "location": "Madisonville, KY",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+12708217476",
    "caseNumber": "H-300-25007-601147",
    "job_duties": "Nursery: Duties to include, but not limited to: Perform any combination of the following duties concerned with preparing soil and growth media, cultivating and otherwise participating in horticulture activities. Haul and spread topsoil, fertilizer, etc. to condition land. Dig, rake and screen soil and fill cold frame and hot beds to prepare them for planting. Plant, spray, weed and water plants, shrubs and trees. Ties, bunches, wraps and pack flowers, plants and shrubs to fill orders. Load truck...",
    "job_index": 46
  },
  {
    "jobTitle": "Nursery Worker",
    "recApplyEmail": "N/A",
    "experience_required": "No",
    "company": "Sargent's Landscape Nursery, Inc",
    "location": "Rochester, MN",
    "salary": "$18.65 per hour",
    "begin_date": "8/20/2025",
    "end_date": "11/30/2025",
    "phone": "+15072863908",
    "caseNumber": "H-300-25002-587978",
    "job_duties": "Daily tasks are, but not limited to; planting plants on our automated planting line or by hand, hand-watering, weeding, deadheading, pulling landscape, contractor, and garden center orders, keeping detailed records when planting, shipping, and pulling orders, and loading/unloading of plant product and other greenhouse goods.  This position also requires being able to work in a variety of weather conditions.  To be successful, you must be physically capable of bending, twisting, being on your fee...",
    "job_index": 47
  }
]