[
  {
    "jobTitle": "Farmworkers and Laborers",
    "recApplyEmail": "michelle@cggamez.com",
    "experience_required": "Yes",
    "company": "ALTA Citrus, LLC (MI Apples #1)",
    "location": "Conklin, MI",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18634521230",
    "caseNumber": "H-300-25162-080303",
    "job_duties": "The job requires a minimum of three months experience in tasks associated with farm experience. The job requires extensive standing and walking. Workers are frequently required to use their hands and arms to handle, feel, reach, climb or balance. Workers are occasionally required to stoop, kneel, crouch, or crawl under trellis wires. Workers must be able to lift/carry up to 60 lbs. throughout the course of the day. Thinning: Thinning is a manual process used as part of orchard maintenance to con...",
    "job_index": 2
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "caineliseo@hotmail.com",
    "experience_required": "Yes",
    "company": "Rivera Evergreens, Inc.",
    "location": "Ennice, NC",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18639904910",
    "caseNumber": "H-300-25161-074791",
    "job_duties": "Workers will harvest white pine tips and Pumpkins as instructed by their supervisor. White Pine Tips: The worker will take a burlap bag from the field truck to the particular area of the field where the tips will be harvest. Worker positions him/herself in front of the white pine tree and will remove the tips from the tree and place them into the burlap bag taking care not to damage the tips or damage the tree. When the burlap bag is full he will take it to the end of the row where he will place...",
    "job_index": 3
  },
  {
    "jobTitle": "Farmworkers & Laborers, Crop, Nursery, Greenhouse",
    "recApplyEmail": "N/A",
    "experience_required": "Yes",
    "company": "Jolly Rancher Trucking LLC",
    "location": "Pocahontas, AR",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15807444031",
    "caseNumber": "H-300-25162-081096",
    "job_duties": "Manually use hand tools such as shovels, scoops, brooms for duties such as auguring grain, scooping grain, turning levers and knobs to dry grain, sweep bins with hand broom after grain is augured; Load agricultural products including corn, rice, soybeans, hay, mixed grain into trucks without over or under filling and drive trucks to market or storage facilities; Operate tractors, tractor-drawn machinery, self-propelled machinery to plant, cultivate, spray and harvest crops; Operate, repair irrig...",
    "job_index": 4
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "cpmgrowers@yahoo.com",
    "experience_required": "Yes",
    "company": "CPM Growers, LLC.",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257180892",
    "caseNumber": "H-300-25149-031233",
    "job_duties": "General farm worker needed for soybean and sugarcane farming. Work includes operating of farm equipment, vehicles, operating of tractors, tractor drawn machinery and self-propelled machinery used to plow, till, harrow, apply fertilizer, herbicides and pesticides to crops; plant, cultivate, and harvest of crops by hand or machine. Cut sugarcane with machetes into segments, load wagons with sugarcane stalks. May work in groups to hand plant sugarcane in furrows while walking/following moving wagon...",
    "job_index": 5
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "ksugarfarms@yahoo.com",
    "experience_required": "Yes",
    "company": "Paul Schexnayder Farms",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257181116",
    "caseNumber": "H-300-25149-031348",
    "job_duties": "General worker corn, farm animals, grain, hay, milo, pasture, ryegrass, soybeans, sugarcane, wheat farm. Work includes tractor driving, field prep, water maint, fertilize, prepare, cultivate, plant, harvest of crops. Field prep includes operating farm equipment, manual shovel work, cleaning drains with shovel and hoeing of weeds, spot spray and gen farm labor. Help repair/maintain animals, barns, bins, bldgs, corrals, ditches, equip, farm, fences, field, grounds, levees, pastures, ponds, propert...",
    "job_index": 6
  },
  {
    "jobTitle": "Orchard Laborer",
    "recApplyEmail": "philip@appalachianorchard.com",
    "experience_required": "Yes",
    "company": "Appalachian Orchard Company",
    "location": "martinsburg, WV",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13049014388",
    "caseNumber": "H-300-25149-031240",
    "job_duties": "Manually plant, cultivate, and harvest fruit and vegetables including; cherries, strawberries, apples, pears, peaches, nectarines, plums, blueberries, blackberries, raspberries, grapes, corn, beans, tomatoes, peppers, eggplants, squash, cucumbers, melons, okra, and pumpkins. Use hand tools, such as, shovels, trowels, hoes, tampers, pruning hooks and shears, knives, hammers, and saws. Duties including manually cultivating all the different crops, hand thinning of any of the different crops, pruni...",
    "job_index": 7
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "tsp829@cox.net",
    "experience_required": "Yes",
    "company": "Purpera Farms, LLC",
    "location": "Plaquemine, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257764364",
    "caseNumber": "H-300-25154-047896",
    "job_duties": "General worker needed for sugarcae farming. Work includes tractor driving, field prep, water maint, fertilize, plant and harvest of crops. Field prep includes operate farm equipment, manual shovel work, cleaning drains with shovel and hoeing of weeds, spot spray and gen farm labor. Help repair and maintain buildings, equip, farm, fences, field, levees, ponds, properties, roads and shop. Load and unload trucks. Worker must be able to lift/carry 50 lbs. M-F, some Sat/Sun, work in excess of 40 hour...",
    "job_index": 8
  },
  {
    "jobTitle": "Farmworker",
    "recApplyEmail": "dcalleros@westernag.com",
    "experience_required": "Yes",
    "company": "WAG Services, Inc. - NE",
    "location": "BERTRAND, NE",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16239074034",
    "caseNumber": "H-300-25153-039535",
    "job_duties": "Crops/Commodities: Install and/or replace hay/silage tarps, livestock shade cloths, and covers in feed yards and other farm locations. Load/unload, lift, carry, and fold/unfold tarps. Cover agricultural products and/or livestock with tarps and covers. Use top straps to secure tarps from wind. Use draw straps, ropes, and/or buckle assemblies to secure the tarp to stacks. Work must be performed carefully to prevent harm to products or animals. All tarps and covers must be secured properly to preve...",
    "job_index": 9
  },
  {
    "jobTitle": "Farmworker",
    "recApplyEmail": "barb@pinetreeappleorchard.com",
    "experience_required": "Yes",
    "company": "Pine Tree Apple Orchard",
    "location": "White Bear Lake, MN",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16514296577",
    "caseNumber": "H-300-25155-050838",
    "job_duties": "Manually plant, cultivate, and harvest produce. Use hand tools, shovels, hoes, tampers, brooms, rakes, pruning shears, and ladders. Clean, pack, sort, slice, box, load and transport harvested products. Maintain trellis and fences. Participate in irrigation activities for all crops. Set up and operate, maintain equipment, vehicles, tractors, forklifts and tractor drawn machinery, ie, spreaders, mowers, plows, cultivators, disks. Work with small engine equipment. Maintain buildings and grounds. As...",
    "job_index": 10
  },
  {
    "jobTitle": "General Farm Worker",
    "recApplyEmail": "toridunham95@outlook.com",
    "experience_required": "Yes",
    "company": "Dunham Brothers Farms, LLC.",
    "location": "Batchelor, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257185003",
    "caseNumber": "H-300-25154-047153",
    "job_duties": "General worker needed for corn, milo, soybean, and sugarcane farm. Work includes operating farm equipment, operate tractor, tractor drawn machinery and self propelled machinery to plow, harrow, and fertilize soil, and/or to plant, cultivate, spray, harvest by hand or machine, along with field prep, and water maint. Field prep includes manual shovel work and hoeing of weeds, spot spray and gen farm labor. Load field wagons with sugarcane stalk pieces, Walk behind wagon and plant by hand sugarcane...",
    "job_index": 11
  },
  {
    "jobTitle": "Farmworker: Diversified",
    "recApplyEmail": "contact@speacialtycroph2a.com",
    "experience_required": "Yes",
    "company": "Specialty Crop Farm Labor Contractors, LLC",
    "location": "Poultney, VT",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17166640408",
    "caseNumber": "H-300-25162-081452",
    "job_duties": "Workers will perform fall harvest-associated work in a vineyard as well as a sweet potato operation. See addendum more details.",
    "job_index": 12
  },
  {
    "jobTitle": "Farmworker/laborer",
    "recApplyEmail": "krafarms@yahoo.com",
    "experience_required": "Yes",
    "company": "KRA Farms, LLC",
    "location": "Vardaman, MS",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+16624141154",
    "caseNumber": "H-300-25164-087761",
    "job_duties": "Workers will be working in greenhouses potting, pruning and weeding tomato plants. Workers will then clean the greenhouse to prepare to start potting, weeding, cutting and transplanting sweet potato slips for harvesting. Workers will also wash produce and repair wood bins for harvested produce, and package produce in packing house. Workers must have 3 months experience in cultivating hot house tomatoes from seed. This is a seasonal position, greenhouse work is only available from September until...",
    "job_index": 13
  },
  {
    "jobTitle": "Farmworker, Laborer",
    "recApplyEmail": "edwinpell77@gmail.com",
    "experience_required": "Yes",
    "company": "P & P Farms, Inc.",
    "location": "Frenchville, ME",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12075437707",
    "caseNumber": "H-300-25169-105609",
    "job_duties": "Workers will perform general farm duties to include servicing machines and equipment such as welding fabrication, tire changing, greasing of equipment, as well as stacking bags of potatoes, pressure washing, cleaning and maintaining buildings, picking rocks and stacking firewood. Workers should have 3 months experience in servicing farm equipment.",
    "job_index": 14
  },
  {
    "jobTitle": "Farmworker: Diversified (45-2092.00)",
    "recApplyEmail": "applicants22366@gmail.com",
    "experience_required": "Yes",
    "company": "Conrow Farms",
    "location": "Brockport, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15857526074",
    "caseNumber": "H-300-25167-096121",
    "job_duties": "Workers will perform all tasks involved in the growing and harvesting of crops. Crops include Apple, Winter Squash, Hay, Soybeans. Sanitation Requirements: For food and general personal safety purposes, all workers will be required and expected to follow common sanitary practices at all times. This is particularly critical when hand harvesting crops for human consumption. Employees are required to cleanse their hands by washing them thoroughly with soap and water after using the bathroom and bef...",
    "job_index": 17
  },
  {
    "jobTitle": "Orchard Worker",
    "recApplyEmail": "teeplefarmsh2a@gmail.com",
    "experience_required": "Yes",
    "company": "Teeple Farms, Inc.",
    "location": "North Rose, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13155871053",
    "caseNumber": "H-300-25167-095419",
    "job_duties": "Crops/Commodities: apples. This job requires a minimum of 3 months of agricultural field work experience handling tasks. Applicants must be able to furnish verbal or written statement establishing relevant prior work experience. Workers must be able to perform manual as well as mechanized activities with accuracy and efficiency. Quality is essential. Fruit is spot picked for fresh market and processing. Workers will be directed to strip all fruit from tree at one picking or to spot pick (selecti...",
    "job_index": 19
  },
  {
    "jobTitle": "Farmworkers and Laborers-crop",
    "recApplyEmail": "Peterfleck@verizon.net",
    "experience_required": "Yes",
    "company": "Beak & Skiff Apple Farms Inc.",
    "location": "Lafayette, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13156775105",
    "caseNumber": "H-300-25149-028418",
    "job_duties": "Manually plant, cultivate, and harvest apples. Use hand tools, such as shovels, trowels, hoes, tampers, pruning hooks, shears, and knives. Duties include tilling soil and applying fertilizers; transplanting, weeding, thinning, or pruning crops; applying pesticides; cleaning, packing, and loading harvested products. Repair fences and farm buildings, or participate in irrigation activities. Set up and operate irrigation equipment. Operate tractors, tractor-drawn machinery, and self-propelled machi...",
    "job_index": 22
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop, Nursery, Greenhouse",
    "recApplyEmail": "lwicker@ncgrowers.org",
    "experience_required": "Yes",
    "company": "NC Growers Assoc.",
    "location": "Vass, NC",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12525270567",
    "caseNumber": "H-300-25157-062838",
    "job_duties": "Applicants hired for these farmworker positions will be given their specific daily work assignments by the grower, or individuals designated by the grower, at the farm where they are employed but should be prepared to perform all of the tasks in all of the crops described in this application. For this application, applicants should expect their work assignments at the beginning of the employment period to begin with fertilizing, pre-planting activities, farm & field site preparation and other ti...",
    "job_index": 23
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop, Nursery, Greenhouse",
    "recApplyEmail": "lwicker@ncgrowers.org",
    "experience_required": "Yes",
    "company": "NC Growers Assoc.",
    "location": "Vass, NC",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12525270567",
    "caseNumber": "H-300-25157-062835",
    "job_duties": "This ETA790A clearance order is filed for farmworkers to perform a wide variety of agricultural work in the production of tobacco and diversified vegetable crops as disclosed in this application. Applicants hired for these farmworker positions will be given their specific daily work assignments by the grower, or individuals designated by the grower, at the farm where they are employed but should be prepared to perform all of the tasks in all of the crops described in this application. For this a...",
    "job_index": 24
  },
  {
    "jobTitle": "Farmworkers and Laborers",
    "recApplyEmail": "dimarefarms@yahoo.com",
    "experience_required": "Yes",
    "company": "DiMare Ruskin, Inc. (#3)",
    "location": "Arcadia, FL",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19413220108",
    "caseNumber": "H-300-25157-060974",
    "job_duties": "Workers will perform assigned duties as instructed by their supervisor. Duties may vary from time to time and may include all of the following job specifications: Committee Meeting/ Training - Worker will attend meeting for farm committee or farm training topic. Field Clean-up - Workers are required to walk fields and pick up plastic, string, plastic remaining on shover ends, & trash and place into container and place at designated areas. Irrigation & Removal - Connecting and installing irrigati...",
    "job_index": 26
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "perezcitrusinc@gmail.com",
    "experience_required": "Yes",
    "company": "Perez Citrus, Inc.",
    "location": "Fellsmere, FL",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17724739492",
    "caseNumber": "H-300-25155-052055",
    "job_duties": "Citrus Harvesting: Workers will perform assigned duties as instructed by their supervisor. Following the supervisors instructions, the worker will place a picking sack over their shoulder and carry an 18' to 20' ladder from the field truck to the particular area of the grove to be harvested. The picking sack is a canvas bag equipped with a shoulder strap for support, an opening for the insertion of fruit, and an opening to remove fruit. A fully loaded sack weighs between approximately 80 and 100...",
    "job_index": 27
  },
  {
    "jobTitle": "Farmworkers and Laborers, Crop",
    "recApplyEmail": "perezcitrusinc@gmail.com",
    "experience_required": "Yes",
    "company": "Perez Citrus, Inc.",
    "location": "Fellsmere, FL",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17727138919",
    "caseNumber": "H-300-25155-051009",
    "job_duties": "Citrus Harvesting: Workers will perform assigned duties as instructed by their supervisor. Following the supervisors instructions, the worker will place a picking sack over their shoulder and carry an 18' to 20' ladder from the field truck to the particular area of the grove to be harvested. The picking sack is a canvas bag equipped with a shoulder strap for support, an opening for the insertion of fruit, and an opening to remove fruit. A fully loaded sack weighs between approximately 80 and 100...",
    "job_index": 28
  },
  {
    "jobTitle": "Farmworkers and Laborers",
    "recApplyEmail": "h2aprogramcoordinator@gmail.com",
    "experience_required": "Yes",
    "company": "Panorama Orchards, LLC",
    "location": "Monitor, WA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15093935775",
    "caseNumber": "H-300-25155-052764",
    "job_duties": "Job Duties Crops: Apples and Pears Apple Harvest: The worker will hand harvest apples, this can be performed from a motorized platform and/or from the ground or a ladder. The worker will attach harness, bucket or bag and pick low hanging fruit while standing on the ground and higher branches while standing on a ladder. The worker will pick according to grade, color and size by grasping fruit with the hands and removing from the tree in a motion so as not to harm adjacent buds on the tree branche...",
    "job_index": 29
  },
  {
    "jobTitle": "Farmworkers Laborers & Crops",
    "recApplyEmail": "JVANDUSERFARMS@AOL.COM",
    "experience_required": "Yes",
    "company": "J VAN DUSER FARMS INC",
    "location": "WALLKILL, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+18455643287",
    "caseNumber": "H-300-25167-095989",
    "job_duties": "Manually prune, plant, cultivate, & harvest apples. Use hand tools, such as shovels, trowels, Hoes, tampers, pruning hooks, shears, & knives. Duties include tilling soil & applying fertilizers; transplanting, weeding, thinning, or pruning crops. Identify plants, pests & weeds to determine the selection & application of pesticides & fertilizers. Apply non-restricted pesticides, Herbicides or fertilizers to crops. Repair & maintain farm vehicles, implements & mechanical equipment. Construct trelli...",
    "job_index": 30
  },
  {
    "jobTitle": "Farmworkers & Laborers, Crop",
    "recApplyEmail": "suzy@jrwoodfarms.com",
    "experience_required": "Yes",
    "company": "J. Roland Wood Farms, Inc.",
    "location": "Benson, NC",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19198942318",
    "caseNumber": "H-300-25163-085203",
    "job_duties": "Pull weeds/chop: Workers will walk along rows as specified by employer and remove weeds and grass from fields by hand or using a hoe. Cultivate and harvest sweet potato, pickling cucumbers and flue-cured tobacco. Load and unload crops and farm materials. THIS JOB DOES NOT INCLUDE CUTTING OR PULLING SWEET POTATO PLANTS. May operate and perform minor maintenance and repairs on farm vehicles, implements and equipment. May repair fences, greenhouses and other farm buildings and structures. Perform f...",
    "job_index": 34
  },
  {
    "jobTitle": "Farmworkers and Laborers Crop",
    "recApplyEmail": "bearmeadowfarm@gmail.com",
    "experience_required": "Yes",
    "company": "Pine Hill Orchards",
    "location": "Colrain, MA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+14136243325",
    "caseNumber": "H-300-25163-083939",
    "job_duties": "Plant. cultivate, and harvest various crops, such as, but not limited to, vegetables, fruit, horticultural specialties, and field crops. Use hand tools, such as, but not limited to, shovels, hoes, pruning shears, saws, knives, and ladders. Duties may Include, but not limited to, tilling soil, apply fertilizer, thinning, pruning, apply general use pesticides or restricted use pesticides under the direct supervision of a certified applicator, picking, cutting, cleaning, sorting, processing, packin...",
    "job_index": 35
  },
  {
    "jobTitle": "Farmworkers and Laborers Crop",
    "recApplyEmail": "fboucher@psouth.net",
    "experience_required": "Yes",
    "company": "Giles Family Farm Inc",
    "location": "Alfred, ME",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12073242944",
    "caseNumber": "H-300-25157-061214",
    "job_duties": "Harvest tree fruit using ladder and picking bucket. Workers will be required to lift 50 pounds while climbing ladder. Work is performed out of doors, sometimes in severe conditions of heat, cold and rain. Workers may perform other farm related tasks such as, cider making, pruning, weeding, thinning, operate farm equipment. May use hand tools such as shovels, hoe, pruning saw. 1 month experience in duties listed required.",
    "job_index": 36
  },
  {
    "jobTitle": "Farmworkers and Laborers Crop",
    "recApplyEmail": "agfarm813@gmail.com",
    "experience_required": "Yes",
    "company": "Rowe Orchard",
    "location": "Newport, ME",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12073684777",
    "caseNumber": "H-300-25157-061188",
    "job_duties": "Apple pickers - one month apple picking experience required. Expected average of 64 bushels/day. Ability to appropriately place 24' wood ladder. Ability to carry 50 lb apple bucket. Ability to pick without bruising. Outdoors work - may be in extreme conditions. Physically demanding - bending, stooping, lifting, carrying Ladder work required.",
    "job_index": 37
  },
  {
    "jobTitle": "Farmworkers and Laborers Crop",
    "recApplyEmail": "stephanie@westwardorchards.com",
    "experience_required": "Yes",
    "company": "Westward Orchards Inc",
    "location": "Harvard, MA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19784568363",
    "caseNumber": "H-300-25164-089046",
    "job_duties": "May perform any combination of tasks related to the planting, cultivating, and processing of fruit and vegetable crops, Including, but not limited to, driving or operating farm machines, maintaining buildings, preparing soil, planting, pruning, weeding, thinning, spraying or apply general use pesticides or restricted use pesticides under the direct supervision of a certified applicator, irrigating, mowing and harvesting. May use hand tools such as shovel, pruning saw, and hoe. 1 month experience...",
    "job_index": 39
  },
  {
    "jobTitle": "Farmworkers & Laborers & Agricultural Equipment Operator",
    "recApplyEmail": "forrenceorchardsjobs@gmail.com",
    "experience_required": "Yes",
    "company": "Forrence Orchards, Inc",
    "location": "Peru, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15186439527",
    "caseNumber": "H-300-25166-094180",
    "job_duties": "All applicants must be able, willing and qualified to perform the work described in the job order and must be available for the entire period of employment specified in Section A. Box 3 & 4. This work order is for qualified people to perform a combination of tasks involved in the packing, pruning and picking of apples. The percentage of apples which are produced and packed by Forrence Orchards, Inc. is 100% and ZERO percentage of apples are grown by other producers. While packing, workers will: ...",
    "job_index": 40
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "aespinosa@agrality.com",
    "experience_required": "Yes",
    "company": "Agrality, Inc.",
    "location": "Lafayette, IN",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+17656397045",
    "caseNumber": "H-300-25153-043131",
    "job_duties": "General farm labor, including, but not limited to: self-pollination, hand cross pollination, leaf sampling, tagging, hand detasseling, hand harvesting, hoeing, shelling, bogging, and seed cleaning. Drive and operate farm machinery such as tractors, ATVs, and self-propelled machinery to till soil, prepare fields, and plant crops. Set up and operate irrigation equipment, including laying pipes, maintaining ditches, and ensuring adequate water supply to crops. Apply fertilizers, herbicides, and pes...",
    "job_index": 45
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "h2a@mytacres.com",
    "experience_required": "Yes",
    "company": "My-T Acres, Inc.",
    "location": "Batavia, NY",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+15853431026",
    "caseNumber": "H-300-25143-013961",
    "job_duties": "Crops including but not limited to: Beans, beets, cabbages, carrots, corn, green beans, oats, potatoes, wheat, sweet corn, rye, onions. Manually pick/lift/carry stones from fields to truck/loader/woods to clear fields. Cut, chop, and/or pull weeds or vines, pick up wood, sticks, and/or stones from fields or hedgerows. Manually hand and/or machine plant cabbage or onion plants. May walk behind machine planter and cover transplanted cabbage or onion plugs. May ride mechanical transplanter and load...",
    "job_index": 46
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "cpmgrowers@yahoo.com",
    "experience_required": "Yes",
    "company": "CPM Growers, LLC.",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257180892",
    "caseNumber": "H-300-25149-031258",
    "job_duties": "General farm worker needed for soybean and sugarcane farming. Work includes operating of farm equipment, vehicles, operating of tractors, tractor drawn machinery and self-propelled machinery used to plow, till, harrow, apply fertilizer, herbicides and pesticides to crops; plant, cultivate, and harvest of crops by hand or machine. Cut sugarcane with machetes into segments, load wagons with sugarcane stalks. May work in groups to hand plant sugarcane in furrows while walking/following moving wagon...",
    "job_index": 47
  },
  {
    "jobTitle": "General Farmworker",
    "recApplyEmail": "jan_liveoakplanting23@yahoo.com",
    "experience_required": "Yes",
    "company": "Live Oak Planting, Inc.",
    "location": "New Roads, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+12257183544",
    "caseNumber": "H-300-25149-031170",
    "job_duties": "General worker needed for soybeans and sugar cane. Work includes driving farm machinery, the operation of tractors, tractor-drawn machinery, and self-propelled machinery used for plowing, tilling, harrowing, applying fertilizers, herbicides, and pesticides to crops; plant, cultivate and harvest crops. Cut the sugar cane with machetes into segments, load the wagons with sugar cane stalks. May work in groups to plant sugarcane in rows while walking/following moving cart. Field preparation includes...",
    "job_index": 48
  },
  {
    "jobTitle": "Farm Worker",
    "recApplyEmail": "bonesmb@aol.com",
    "experience_required": "Yes",
    "company": "Amore Farms",
    "location": "Marion, AR",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+19013015923",
    "caseNumber": "H-300-25149-028752",
    "job_duties": "Drive and operate farm machinery such as tractors, ATVs, and self-propelled machinery to till soil, prepare fields, and plant crops; Perform mechanical repairs and maintenance on farm vehicles, implements, and equipment; Set up and operate irrigation equipment, including laying pipes, maintaining ditches, and ensuring adequate water supply to crops; Apply fertilizers, herbicides, and pesticides to crops using hand sprayers and other equipment; Conduct regular crop inspections to monitor growth, ...",
    "job_index": 49
  },
  {
    "jobTitle": "Field Workers",
    "recApplyEmail": "buddyoubrefarms@gmail.com",
    "experience_required": "Yes",
    "company": "none used",
    "location": "St. Martinville, LA",
    "salary": "$17.96 per hour",
    "begin_date": "7/31/2025",
    "end_date": "10/31/2025",
    "phone": "+13372305268",
    "caseNumber": "H-300-25155-053978",
    "job_duties": "Planting of sugarcane by hand; farm and field sanitation duties; operation and performing minor repairs and maintenance of farm vehicles and equipment in the field. Able to work in hot, humid weather, bending and stooping to reach ground level crops and able to stand on feet for long periods of time. Once hired, workers may be required to take a random drug test at no cost to worker. Testing positive or failure to comply may result in immediate termination.",
    "job_index": 50
  }
]